Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (6) “Son of noble family, the tathāgatas know in accordance with reality the paths that lead to all destinies.

source: ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the beings who are destined for truth.

source: མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །ལོག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the beings who are undetermined and the beings who are destined for error.

source: ངེས་པ་དང་བཅས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the beings who are determined.

source: སེམས་ཅན་གང་དག་རྒྱུའི་སྟོབས་ཅན། སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ། ཟུར་ཙམ་གྱིས་གོ་བ། དབང་པོ་རྣོ་བའི་སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཀྱང་རུང་། མ་བསྟན་ཀྱང་རུང་སྟེ་རྣམ་པར་གྲོལ་བའི་སྐལ་བ་ཡོད་པ་
en: Whether the tathāgatas teach the Dharma to them or not, those beings who have causal capacity and excellent prior engagement, who understand through mere outlines and whose intelligence is sharp, are destined to become liberated.

source: དེ་དག་དེ་བཞིན་གཤེགས་པས་སྔོན་གྱི་རྒྱུའི་སྟོབས་མཁྱེན་ནས་ཅི་ནས་དེ་དག་མྱུར་དུ་རྣམ་པར་གྲོལ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏོ། །
en: The tathāgatas understand their causal capacity, and, in order to accelerate their liberation, they teach them the Dharma accordingly.

source: མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏེ།
en: “They know the beings who are undetermined.

source: གང་དག་རྐྱེན་གྱི་སྟོབས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཚན་ཉིད་ཀྱི་སེམས་ཅན་དེ་དག་གལ་ཏེ་འཐུན་པར་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དང་ཕྲད་ན་རྣམ་པར་གྲོལ་བར་འགྱུར་གྱི་མ་ཕྲད་ན་རྣམ་པར་གྲོལ་བར་མི་འགྱུར་བ་
en: If they meet an agreeable teaching and instruction, beings who are swayed by conditions and characterized by having to mature will become liberated. But if they do not, then they will not become liberated.

source: དེ་དག་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལྟ་དེ་ལྟར་རྒྱུ་དང་རྐྱེན་དང་ལྡན་པའི་གཏམ་ཡང་དག་པར་གསུང་སྟེ
en: To them the tathāgatas deliver discourses on causes and conditions.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལས་དེ་ལྟ་བུའི་ཆོས་ཐོས་ནས་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བས་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་
en: In this way, once they have heard the Dharma from the tathāgatas, they apply themselves accordingly and attain the result.

source: དེ་དག་གི་དོན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་ངོ་། །
en: It is for their sake that the blessed buddhas appear.

source: ལོག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ།
en: “They know the beings who are destined for error.

source: ཡོངས་སུ་སྦྱོང་བ་མ་བྱས་པ། ཁོ་རེ་ཆུང་བ་བླུན་པ། སྣོད་དུ་མ་གྱུར་པའི་སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཀྱང་རུང་། །མ་བསྟན་ཀྱང་རུང་སྟེ་སེམས་ཅན་དེ་དག་རྣམ་པར་དགྲོལ་བའི་སྐལ་བ་མེད་པས།
en: Whether they teach the Dharma to them or not, those beings who have not purified themselves, who are narrow minded, foolish, and unreceptive, are not destined for liberation.

source: དེ་དག་དེ་བཞིན་གཤེགས་པས་སྣོད་མ་ཡིན་པར་རིག་ནས་བཏང་སྙོམས་སུ་འཇོག་སྟེ།
en: The tathāgatas are aware that they are not receptive and thus remain equanimous toward them.

source: དེ་དག་གི་ཆེད་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གོ་ཆ་གྱོན་ཏོ། །
en: It is for their sake that the bodhisattvas don their armor.

source: རིགས་ཀྱི་བུ། གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདོད་ཆགས་ཀྱི་ལམ་རྣམ་པ་གསུམ་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Son of noble family, the tathāgatas know the three paths of attachment.

source: རྣམ་པ་གསུམ་གང་ཞེ་ན།
en: What are the three?

source: འདོད་ཆགས་ཀྱི་ལམ་སྡུག་པའི་རྣམ་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། །འདོད་ཆགས་ཀྱི་ལམ་རྗེས་སུ་ཆགས་པའི་རྣམ་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། འདོད་ཆགས་ཀྱི་ལམ་སྔོན་གྱི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད་དོ། །
en: They are the path of attachment arising from attraction, the path of attachment arising from clinging, and the path of attachment arising from previous causes.

source: ཞེ་སྡང་གི་ལམ་རྣམ་པར་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ།
en: They know the three paths of aversion:

source: ཞེ་སྡང་གི་ལམ་ཁོང་ཁྲོ་བའི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད། ཞེ་སྡང་གི་ལམ་བསམ་པ་ཡོངས་སུ་མ་རྫོགས་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། ཞེ་སྡང་གི་ལམ་སྔོན་གྱི་བག་ལ་ཉལ་ལས་སྐྱེ་བ་ཡང་ཡོད་དོ། །
en: the path of aversion arising from the cause of anger, the path of aversion arising from unfulfilled wishes, and the path of aversion arising from preexisting latent tendencies.

source: གཏི་མུག་གི་ལམ་རྣམ་པ་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ།
en: They know the three paths of delusion:

source: གཏི་མུག་གི་ལམ་མ་རིག་པའི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད། གཏི་མུག་གི་ལམ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད། གཏི་མུག་གི་ལམ་ཐེ་ཚོམ་གྱི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད་དེ།
en: the path of delusion arising from the cause of ignorance, the path of delusion arising from the cause of personalistic false views, and the path of delusion arising from the cause of doubt.

source: དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: All these the tathāgatas know.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དབང་པོ་རྣོ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་དཀའ་བའི་ལམ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་རྟུལ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་དཀའ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Moreover, son of noble family, the tathāgatas know the difficult paths that swiftly lead to the superknowledges for those with sharp faculties and the difficult paths that slowly lead to the superknowledges for those with dull faculties.

source: དབང་པོ་རྣོ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་རྟུལ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་དཀའ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the easy paths that swiftly lead to the superknowledges for those with sharp faculties and the difficult paths that swiftly lead to the superknowledges for those with dull faculties.

source: དམིགས་པ་བོར་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །ལམ་གྱི་རྒྱུན་མ་བཅད་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the paths that very slowly lead to the superknowledges because of beings’ loss of focus and the slower paths that may nonetheless swiftly lead to the superknowledges because their continuities are uninterrupted.

source: ཡོངས་སུ་ཐུག་པ་མེད་པར་དབུགས་འབྱིན་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་མྱུར་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་ལ་མ་ཆགས་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །སོ་སོར་རྟོག་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཀྱི་སྒོམ་པའི་སྟོབས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་དེ། དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the swift paths that may nonetheless lead slowly to the superknowledges on account of falling short of final relief and the slow paths that nonetheless lead swiftly to the superknowledges on account of one not being attached to such paths.

source: སྒོམ་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཀྱི། སོ་སོར་རྟོག་པའི་སྟོབས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་དེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The tathāgatas know that there are paths where it is not the power of meditation but the power of discrimination that is brought to perfection.

source: སོ་སོར་རྟོག་པའི་སྟོབས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་མི་བྱེད་ལ་སྒོམ་པའི་སྟོབས་ལ་ཡང་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་དེ། དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that there are paths where it is not the power of discrimination but the power of meditation that is brought to perfection.

source: སོ་སོར་རྟོག་པའི་སྟོབས་དང་སྒོམ་པའི་སྟོབས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ལམ་ཡང་ཡོད་དེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that there are paths where neither the power of meditation nor the power of discrimination is brought to perfection.

source: བསམ་པ་ཕུན་སུམ་ཚོགས་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་དེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that there are paths where both the power of discrimination and the power of meditation are brought to perfection.

source: སྦྱོར་བ་ཕུན་སུམ་ཚོགས་ལ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་དེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The tathāgatas know that there are paths with excellent intention but without excellent application.

source: བསམ་པ་ཡང་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་ལ་སྦྱོར་བ་ཡང་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད།
en: They know that there are paths without excellent intention but with excellent application.

source: བསམ་པ་ཡང་ཕུན་སུམ་ཚོགས་ལ་སྦྱོར་བ་ཡང་ཕུན་སུམ་ཚོགས་པའི་ལམ་ཡང་ཡོད་དེ། དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that there are paths without excellent intention or application. They know that there are paths with both excellent intention and application.

source: ལུས་སྦྱོང་གི །ངག་ལ་མ་ཡིན། སེམས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད།
en: “There are paths where it is neither the speech nor the mind but the body that is purified.

source: ངག་སྦྱོང་གི །ལུས་ལ་མ་ཡིན། སེམས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད།
en: There are paths where it is neither the body nor the mind but the speech that is purified.

source: ལུས་དང་། ངག་དང་། སེམས་ཀྱང་སྦྱོང་བའི་ལས་ཡང་ཡོད།
en: There are paths where the body, speech, and mind are all purified.

source: ལུས་ལ་མ་ཡིན། ངག་ལ་མ་ཡིན་ལ། སེམས་ཀྱང་མི་སྦྱོང་བའི་ལམ་ཡང་ཡོད་དེ།
en: There are paths where neither the body nor the speech nor the mind are purified.

source: དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇུག་པའི་རྒྱུ་ལས་བྱུང་བ་དང་། ལོག་པའི་རྒྱུ་ལས་བྱུང་བའི་ལམ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པ་འཇུག་སྟེ
en: “In this way, the vision of a tathāgata’s wisdom enters, without obstruction, the full extent of the paths that arise from the causes of the engagements of all sentient beings and from the causes of error.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་དྲུག་པའོ། །
en: This is the sixth tathāgata activity of the tathāgatas.

source: བདེ་བར་གཤེགས་པས་ལམ་ཀུན་རབ་ཏུ་མཁྱེན་ཅིང་ངེས་དང་རྒྱུ་དང་བཅས་པའི་སེམས་ཅན་ཁམས་ཀྱང་མཁྱེན། །
en: “ ‘The sugatas know all the paths and the beings who are destined and have the cause.

source: མ་ངེས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཚན་ཉིད་དང་ནི་དེ་བཞིན་སྣོད་མིན་ལོག་པར་ལྟ་ལྡན་དང་། །འདོད་ཆགས་རྣམ་གསུམ་ལམ་ལྡན་དག་དང་ཞེ་སྡང་རྣམ་པ་གསུམ་དང་དེ་བཞིན་གཏི་མུག་ལྡན་པ་དང་། །ཉོན་མོངས་ཁམས་ཀྱི་རྣམ་པ་མཐའ་ཡས་པ་དང་ལམ་གྱི་རྒྱུ་དང་རྐྱེན་ཀྱང་སྟོན་པས་རབ་ཏུ་མཁྱེན། །
en: These teachers know the endless kinds of afflictive elements of those characterized as undetermined and as having to mature, Those who are unreceptive and harbor wrong views, and those beset by three kinds of attachment, three kinds of aversion, and the associated ignorance, As well as the causes and conditions for such paths.

source: རྣོ་བར་གྱུར་ལ་དཀའ་བའི་ལམ་དང་དེ་བཞིན་དབང་པོ་རྣམས་ནི་ཞན་ཕྱིར་བུལ་བར་གྱུར་པ་དང་། །རྣོ་བར་འགྱུར་ལ་སླ་བའི་ལམ་དང་དེ་བཞིན་བུལ་བ་འཇིག་རྟེན་གྱི་ནི་མགོན་པོས་རབ་ཏུ་མཁྱེན། །
en: “ ‘The protectors of the world understand the paths that are difficult for the sharp ones and at the same time slow for those of feeble capacity, And the paths that are easy for the sharp ones and at the same time slow for the others.

source: བུལ་བའི་ལམ་ལ་དེ་ཡི་བློ་ཡང་བུལ་ཞིང་དེ་བཞིན་བུལ་བར་གྱུར་ལ་རྣོ་ཞིང་དག་པའང་ཡོད། །
en: there are paths that are slow for the slow witted and at the same time slow for the sharp and pure ones.

source: བུལ་བར་གྱུར་ལ་མྱུར་བའི་ལམ་དང་དེ་བཞིན་དེ་ལ་མ་ཆགས་ཕྱིར་ནི་ཤིན་ཏུ་མྱུར་བ་དང་། །
en: There are paths that are swift for the slow ones and at the same time very swift for those not attached to them.

source: སོ་སོར་རྟོག་པ་སྐྱེད་པར་བྱེད་ཀྱི་བསྒོམ་པའི་ལམ་ནི་སྐྱེད་པར་མི་བྱེད་པ་ཡི་ལམ་ཡང་ཡོད། །
en: “ ‘There are paths of meditation that generate discrimination and those that do not.

source: སྒོམ་པ་སྐྱེད་པར་བྱེད་དང་ཁྱད་པར་ཅན་གྱི་སྦྱོར་དང་ལྡན་པས་གཉི་ག་སྐྱེད་པར་བྱེད་པའང་ཡོད། །
en: There are those that generate meditation and those that generate both due to having outstanding application.

source: བསམ་པ་རྣམ་པར་སྦྱོང་བར་བྱེད་ཀྱི་སྦྱོར་བ་དག་པར་བྱེད་པ་མ་ཡིན་པ་ཡི་ལམ་ཡང་ཡོད། །གཉི་ག་སྦྱོར་བར་བྱེད་པའང་ཡོད་དེ་དེ་ཡང་
en: There are paths that purify intention but not application, And there are the paths that engage in both.

source: སངས་རྒྱས་བདག་ཉིད་ཆེན་པོ་ཐམས་ཅད་གཟིགས་པས་མཁྱེན། །
en: The buddhas, the all-seeing great beings, know that

source: ལུས་ནི་རྣམ་པར་སྦྱོང་བར་བྱེད་ཀྱི་ངག་ལ་མ་ཡིན་པ་དང་སེམས་ཀྱང་སྦྱོང་བར་མི་བྱེད་ཡོད། །
en: “ ‘There are paths that purify the body but not the speech or the mind,

source: ཚིག་དང་དེ་བཞིན་ལུས་ཀྱང་སྦྱོང་བར་བྱེད་ཀྱི་ནམ་ཡང་སེམས་ནི་རྣམ་པར་སྦྱོང་བར་མི་བྱེད་དང་། །
en: Some that purify speech and the body but never the mind,

source: སེམས་ནི་རྣམ་པར་སྦྱོང་བར་བྱེད་ཀྱི་ནམ་ཡང་ངག་ནི་རྣམ་པར་སྦྱོང་བར་མི་བྱེད་པ་ཡང་ཡོད། །
en: And some that purify the mind but never speech.

source: ངག་དང་དེ་བཞིན་སེམས་ཀྱང་སྦྱོང་བར་བྱེད་ཀྱི་ནམ་ཡང་ལུས་ནི་རྣམ་པར་སྦྱོང་བར་མི་བྱེད་དང་། །ལུས་དང་དེ་བཞིན་སེམས་ཀྱང་སྦྱོང་བར་བྱེད་པའི་ལམ་དང་
en: “ ‘There are some that purify speech and the mind but never the body, And some that purify both body and mind.

source: ཇི་ལྟར་འཇུག་པར་འགྱུར་དང་ལྡོག་པ་ཡང་། །
en: As for how they engage or refrain,

source: ཡེ་ཤེས་དང་ནི་སེམས་གཟིགས་པས་མཁྱེན་འདི་ཡང་བདེ་གཤེགས་འཕྲིན་ལས་ཁྱད་པར་འཕགས་པ་དྲུག །
en: This knowledge born of seeing wisdom and the mind is the sixth outstanding sugata activity.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (7) “Moreover, son of noble family, the tathāgatas know in accordance with reality the process of pollution, purification, and emergence through concentration, liberation, absorption, and meditation.

source: སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་སྐྱེ་བའི་རྒྱུ་གང་ཡིན་པ་དང་། རྐྱེན་གང་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know the causes and conditions for the arising of sentient beings’ pollution.

source: སེམས་ཅན་རྣམས་རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་གང་ཡིན་པ་དང་། རྐྱེན་གང་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the causes and conditions for sentient beings’ purification.

source: དེ་ལ་རྒྱུ་ནི་གང་། རྐྱེན་ནི་གང་ཞེ་ན།
en: What are causes? What are conditions?

source: སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུ་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པའོ། །
en: The cause of sentient beings’ pollution is improper mental activity.

source: སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྐྱེན་ནི་མ་རིག་པའོ། །
en: The condition for sentient beings’ pollution is ignorance.

source: མ་རིག་པ་ནི་རྒྱུའོ། །འདུ་བྱེད་རྣམས་ནི་རྐྱེན་ཏོ། །
en: Ignorance is a cause and formations are conditions.

source: འདུ་བྱེད་ནི་རྒྱུའོ། །རྣམ་པར་ཤེས་པ་ནི་རྐྱེན་ཏོ། །
en: The formations are causes and consciousness is a condition.

source: རྣམ་པར་ཤེས་པ་ནི་རྒྱུའོ། །མིང་དང་གཟུགས་ནི་རྐྱེན་ཏོ། །
en: Consciousness is a cause and name and form are conditions.

source: མིང་དང་གཟུགས་ནི་རྒྱུའོ། །སྐྱེ་མཆེད་དྲུག་ནི་རྐྱེན་ཏོ། །
en: Name and form are causes and the six sense fields are conditions.

source: སྐྱེ་མཆེད་དྲུག་ནི་རྒྱུའོ། །རེག་པ་ནི་རྐྱེན་ཏོ། །
en: The six sense fields are causes and contact is a condition.

source: རེག་པ་ནི་རྒྱུའོ། །ཚོར་བ་ནི་རྐྱེན་ཏོ། །
en: Contact is a cause and sensation is a condition.

source: ཚོར་བ་ནི་རྒྱུའོ། །སྲེད་པ་ནི་རྐྱེན་ཏོ། །
en: Sensation is a cause and craving is a condition.

source: སྲེད་པ་ནི་རྒྱུའོ། །ཉེ་བར་ལེན་པ་ནི་རྐྱེན་ཏོ། །
en: Craving is a cause and appropriation is a condition.

source: ཉེ་བར་ལེན་པ་ནི་རྒྱུའོ། །སྲིད་པ་ནི་རྐྱེན་ཏོ། །
en: Appropriation is a cause and becoming is a condition.

source: སྲིད་པ་ནི་རྒྱུའོ། །སྐྱེ་བ་ནི་རྐྱེན་ཏོ། །
en: Becoming is a cause and birth is a condition.

source: སྐྱེ་བ་ནི་རྒྱུའོ། །རྒ་ཤི་ནི་རྐྱེན་ཏོ། །
en: Birth is a cause and old age and death are conditions.

source: རྒ་ཤི་ནི་རྒྱུའོ། །ཉོན་མོངས་པ་རྣམས་ནི་རྐྱེན་ཏོ། །
en: Old age and death are causes and afflictive emotions are conditions.

source: ཉོན་མོངས་པ་རྣམས་ནི་རྒྱུའོ། །ལས་རྣམས་ནི་རྐྱེན་ཏོ། །
en: Afflictive emotions are causes and actions are conditions.

source: ལྟ་བ་ནི་རྒྱུའོ། །སྲེད་པ་ནི་རྐྱེན་ཏོ། །
en: Views are causes and craving is a condition.

source: བག་ལ་ཉལ་ནི་རྒྱུའོ། །ཀུན་ནས་ལྡང་བ་ནི་རྐྱེན་ཏོ། །
en: Latent tendencies are causes and their activations are conditions.

source: འདི་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུའོ། །འདི་ནི་རྐྱེན་ཏོ། །
en: These are the causes and conditions of beings’ pollution.

source: དེ་ལ་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་ནི་གང་། རྐྱེན་ནི་གང་ཞེ་ན།
en: “What are the causes and conditions for sentient beings’ purification?

source: སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་སོ། །
en: There are two causes or two conditions for sentient beings’ purification.

source: གཉིས་གང་ཞེ་ན།
en: What are these two?

source: གཞན་ལས་རྗེས་སུ་འཐུན་པའི་སྒྲ་དང་། སོ་སོ་བདག་ཉིད་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་སྟེ། གཉིས་པོ་འདི་དག་གོ། །
en: Another’s words to be followed and one’s own correct mental activity form a pair.

source: གཞན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ།
en: One-pointed tranquil abiding and skill in special insight also form a pair of causes or conditions.

source: ཞི་གནས་ལ་རྩེ་གཅིག་པ་དང་། ལྷག་མཐོང་ལ་མཁས་པའོ། །གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། འོང་བ་མེད་པར་ཤེས་པ་དང་། འགྲོ་བ་མེད་པར་ཤེས་པའོ། །གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། སྐྱེ་བ་མེད་པར་རབ་ཏུ་རྟོག་པ་དང་། ངེས་པར་གྱུར་པ་ལ་རེག་པར་བྱེད་པའོ། །གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། རྐང་པར་ལྡན་པ་དང་། རིག་པས་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱེད་པའོ། །གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། རྣམ་པར་ཐར་པའི་སྒོ་ལ་སྒོམ་པ་དང་། རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བར་ཤེས་པའོ། །གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པའོ། །
en: The same applies as well as to knowing that there is no coming and knowing that there is no going, realizing nonorigination and reaching certainty, actualizing liberation through virtuous conduct and knowledge, cultivating the gates to liberation and knowing what is naturally liberated, and knowing contamination and knowing nonorigination.

source: གཞན་ཡང་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། བདེན་པ་རྗེས་སུ་རྟོགས་པ་དང་། བདེན་པ་རྗེས་སུ་ཐོབ་པ་སྟེ། འདི་ནི་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་རྒྱུའོ། །
en: Finally, the pair consisting of realizing the truth and attaining the truth is a pair of causes or conditions for beings’ purification.

source: འདི་ནི་རྐྱེན་ཏེ། དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: All these the tathāgatas know.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པ་ཚད་མེད། རྣམ་པར་དག་པ་ལ་དམིགས་པ་ཡང་ཚད་མེད་དེ།
en: “Moreover, son of noble family, the perceptions of pollution are immeasurable, and the perceptions of their purification are equally immeasurable.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པས་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པ་རྣམ་པར་བྱང་བ་ལ་དམིགས་པར་འཇོག་པ་ཡང་ཡོད། །
en: By discriminating in accordance with reality, the perceptions of pollution are replaced by those of their purification.

source: ལྷག་པའི་ང་རྒྱལ་གྱིས་འཛིན་པས་རྣམ་པར་དག་པ་ལ་དམིགས་པ་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པར་འཇོག་པ་ཡང་ཡོད་དེ།
en: But by grasping with excessive pride, the perceptions of purification may be replaced by those of pollution.

source: དེ་ལ་སྣྲེལ་ཞིའི་རྣམ་གྲངས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འཇུག་གོ། །
en: Thus, through nonsequential enumerations, one enters the wisdom of the tathāgatas.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་འདི་ལྟ་བུ་དང་ལྡན་པས་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ་དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན།
en: “Son of noble family, endowed with such wisdom, the tathāgatas are detached from desires and sinful nonvirtuous factors, possess applied and sustained thought, and are joyful and blissful through detachment.

source: བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་ཞུགས་ཏེ་འགོག་པ་ལས་ལྡང་ངོ་། །
en: Attaining the first concentration, the tathāgatas emerge from cessation.

source: འགོག་པ་ལས་སྙོམས་པར་ཞུགས་ཏེ་བསམ་གཏན་དང་པོ་ལས་ལྡང་ངོ་། །
en: Attaining cessation, they emerge from the first concentration.

source: རྣམ་པར་ཐར་པ་བརྒྱད་ལ་རྗེས་སུ་འཐུན་པར་སྙོམས་པར་འཇུག་གོ། །མི་འཐུན་པར་ཡང་སྙོམས་པར་འཇུག་གོ། །
en: They have attainments that follow the sequence of the eight liberations and attainments that do not.

source: ཐོད་རྒལ་དུ་ཡང་སྙོམས་པར་འཇུག་གོ། །
en: They also have attainments in a nonsequential order.

source: ཏིང་ངེ་འཛིན་ནི་སྙོམས་པར་འཇུག་པར་སྟོན། སྙོམས་པར་འཇུག་པ་ནི་ཏིང་ངེ་འཛིན་དུ་སྟོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལ་འདྲེས་པ་གང་ཡང་མེད་ཅིང་
en: Although absorption is revealed as attainment and attainment is revealed as absorption, there is no blending at all within the tathāgatas’ absorption.

source: དེ་བཞིན་གཤེགས་པ་ལ་ནི་དམིགས་པས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་བྱ་བ་མེད་དོ། །
en: For them there is no attainment in absorption in terms of objective reference points.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གཅིག་གིས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མངོན་པར་འགྲུབ་སྟེ།
en: A single tathāgata absorption accomplishes all absorptions.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་གཅིག་ལས་མ་བཞེངས་པར་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་ཀྱང་། དེ་བཞིན་གཤེགས་པ་ལ་སེམས་གཅིག་ནས་གཅིག་ཏུ་འཇུག་པ་མེད་དོ། །
en: Without emerging from a single absorption, the tathāgatas attain all absorptions, but for them there is no fluctuation from one mental moment to another.

source: དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མཉམ་པར་མ་བཞག་པ་མི་དམིགས་སོ། །
en: For the tathāgatas, a mind outside of equipoise does not exist.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་སུས་ཀྱང་བལྟ་བར་མི་ནུས་ཏེ།
en: No one is able to witness a tathāgata absorption.

source: ཉན་ཐོས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཟིལ་གྱིས་ནོན་ཏོ། །རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཟིལ་གྱིས་ནོན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ནི་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་ཟིལ་གྱིས་ནོན་ཏོ། །
en: A śrāvaka absorption is surpassed by a pratyekabuddha absorption. This is in turn surpassed by the bodhisattva absorption, which is in turn surpassed by the tathāgata absorption, which is unsurpassed.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་ཟིལ་གྱིས་མི་ནོན་པ་སྟེ་འདི་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནི་ཟིལ་གྱིས་མི་ནོན་པར་འཇུག་གོ། །
en: Due to that the tathāgata wisdom penetrates unchallenged.

source: གདམས་པ་གང་དང་རྗེས་སུ་བསྟན་པ་གང་གིས་ཉན་ཐོས་རྣམས་ཏིང་ངེ་འཛིན་སྐྱེད་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The tathāgatas know the instructions and guidance by which śrāvakas cultivate their meditative absorptions.

source: དེ་བཞིན་དུ་རང་སངས་རྒྱས་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Likewise, they know those by which pratyekabuddhas and bodhisattvas cultivate theirs.

source: མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་འདོམས་ཤིང་དེ་བཞིན་དུ་རྗེས་སུ་སྟོན་ཏེ།
en: Understanding these, they instruct and guide beings accordingly.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བདུན་པའོ། །
en: This is the seventh tathāgata activity of the tathāgatas.

source: འདིར་ནི་འགྲོ་བའི་ཀུན་ནས་ཉོན་མོངས་རྒྱུ་དང་རྐྱེན། །རྒྱལ་བ་རང་བྱུང་ཡེ་ཤེས་ལྡན་པས་དེ་ཀུན་མཁྱེན། །
en: “ ‘Through their naturally occurring wisdom, The victors know all the causes and conditions for beings’ pollution.

source: དེ་བཞིན་མངོན་པར་བརྩོན་རྒྱུས་རྣམ་དག་འགྱུར་བ་ཡི། །རྒྱུ་དང་རྐྱེན་དེ་ཆོས་ཀྱི་རྗེས་ནི་རབ་ཏུ་མཁྱེན། །
en: Likewise, the Dharma lords know the causes and conditions Of purification engendered by striving.

source: ཚུལ་བཞིན་མ་ཡིན་རྒྱུ་སྟེ་རྐྱེན་ནི་མ་རིག་པ། །རྒྱུ་ནི་མ་རིག་པ་སྟེ་རྐྱེན་ནི་འདུ་བྱེད་ཡིན། །
en: “ ‘The cause is what is improper, and the condition is ignorance. The cause is ignorance, and the condition is the formations.

source: རྣམ་པར་ཤེས་དང་མིང་དང་གཟུགས་དང་དབང་པོ་དྲུག །ཐམས་ཅད་སྲེད་པའི་ཡན་ལག་འགྲོ་བའི་རྒྱུ་དང་རྐྱེན། །
en: Consciousness, name and form, and the six sense faculties Are all causes and conditions for wandering through the stages of existence.

source: ཉོན་མོངས་རྣམས་ནི་རྒྱུ་སྟེ་དེ་བཞིན་ལས་རྣམས་རྐྱེན། །
en: “ ‘It is taught that afflictive emotions are causes and actions are conditions,

source: ལྟ་བ་རྒྱུ་སྟེ་དེ་བཞིན་སྲེད་པ་རྐྱེན་དུ་གསུངས། །
en: Views are causes and craving the condition.

source: ཀུན་དུ་སྦྱོར་དང་བག་ལ་ཉལ་འདི་འདིར་རྒྱུ་སྟེ། །
en: Entanglements and their latent tendencies are causes for this.

source: མི་གང་རྒྱུ་ལས་ཀུན་དུ་བྱུང་བ་དེ་འདིར་རྐྱེན། །
en: People subject to these causes are conditioned like that.

source: འགྲོ་བ་རྣམ་དག་འགྱུར་བའི་རྒྱུ་དང་རྐྱེན་གཉིས་ཏེ། །
en: “ ‘There are different pairs of causes or conditions for beings’ purification.
